Tekla Open API Reference for Tekla Structures 2025
IntList.Contains Method
 Checks if the given integer is in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Contains(
	int value
)
Public Function Contains (
	value As Integer
) As Boolean
Parameters
value
Type: System.Int32
The integer to be checked.
Return Value
Type: Boolean
True if the integer is in the list, otherwise false.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace